[Killed] LogicalOperator
main/components/Announcements/AnnouncementsForm.js:13:25
         handleSubmit,
     } = useForm(
         // modifiedCommons is guaranteed to be defined (initialCommons or {})
-        {defaultValues: initialAnnouncements || {}, }
+        {defaultValues: initialAnnouncements && {}, }
     );
 
killedBy: AnnouncementsForm tests renders correctly when passing in initialContents
statusReason: Error: expect(element).toHaveValue(2012-03-05T15:50)

Expected the element to have value:
  2012-03-05T15:50
Received:

[Killed] ConditionalExpression
main/components/Announcements/AnnouncementsForm.js:13:25
         handleSubmit,
     } = useForm(
         // modifiedCommons is guaranteed to be defined (initialCommons or {})
-        {defaultValues: initialAnnouncements || {}, }
+        {defaultValues: false, }
     );
 
killedBy: AnnouncementsForm tests renders correctly when passing in initialContents
statusReason: Error: expect(element).toHaveValue(2012-03-05T15:50)

Expected the element to have value:
  2012-03-05T15:50
Received:

[Killed] StringLiteral
main/components/Announcements/AnnouncementsForm.js:16:26
         {defaultValues: initialAnnouncements || {}, }
     );
 
-    const testIdPrefix = "announcementsForm";
+    const testIdPrefix = "";
 
     return (
killedBy: AnnouncementsForm tests renders correctly with no initialContents
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="announcementsForm-start"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Announcements/AnnouncementsForm.js:28:35
                     type="datetime-local" 
                     isInvalid={Boolean(errors.start)}
                     {...register("start", {
-                        required: "start is required.",
+                        required: "",
                     })}
                 />
killedBy: AnnouncementsForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /start is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Announcements/AnnouncementsForm.js:59:35
                     id="announcement"
                     isInvalid={Boolean(errors.announcement)}
                     {...register("announcement", {
-                        required: "announcement is required.",
+                        required: "",
                     })}
                 >
killedBy: AnnouncementsForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /announcement is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
