[Killed] BlockStatement
main/components/Announcements/AnnouncementsTable.js:17:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/admin/editannouncements/${cell.row.values["announcements.id"]}`);
-    }
+    const editCallback = (cell) => {}
 
     const deleteMutation = useBackendMutation(
killedBy: Modal tests Clicking Edit button navigates to correct link
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/admin/editannouncements/1"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Announcements/AnnouncementsTable.js:18:62
     const navigate = useNavigate();
 
     const editCallback = (cell) => {
-        navigate(`/admin/editannouncements/${cell.row.values["announcements.id"]}`);
+        navigate(`/admin/editannouncements/${cell.row.values[""]}`);
     }
 
killedBy: Modal tests Clicking Edit button navigates to correct link
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/admin/editannouncements/1"
Received: "/admin/editannouncements/undefined"

Number of calls: 1

<html>

[Killed] ArrayDeclaration
main/components/Announcements/AnnouncementsTable.js:24:9
     const deleteMutation = useBackendMutation(
         cellToAxiosParamsDelete,
         { onSuccess: onDeleteSuccess },
-        ["/api/announcements/all"]
+        []
     );
 
killedBy: Modal tests Clicking Permanently Delete button deletes the announcements
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [Function cellToAxiosParamsDelete], {"onSuccess": [Function onDeleteSuccess]}, ["/api/announcements/all"]
Received
       1
          [Function cellToAxiosParamsDelete],
          {"onSuccess": [Function onDeleteSuccess]},
        - Array [

[Killed] StringLiteral
main/components/Announcements/AnnouncementsTable.js:24:10
     const deleteMutation = useBackendMutation(
         cellToAxiosParamsDelete,
         { onSuccess: onDeleteSuccess },
-        ["/api/announcements/all"]
+        [""]
     );
 
killedBy: Modal tests Clicking Permanently Delete button deletes the announcements
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [Function cellToAxiosParamsDelete], {"onSuccess": [Function onDeleteSuccess]}, ["/api/announcements/all"]
Received
       1
          [Function cellToAxiosParamsDelete],
          {"onSuccess": [Function onDeleteSuccess]},
          Array [

[Killed] ArrayDeclaration
main/components/Announcements/AnnouncementsTable.js:38:21
     };
 
 
-    const columns = [
-        {
-            Header: 'Announcement Id',
-            accessor: 'announcements.id', 
-
-        },
-        {
-            Header:'Commons Id',
-            accessor: 'announcements.commonsId',
-        },
-        {
-            Header: 'Start',
-            accessor: 'announcements.start',
-        },
-        {
-            Header: 'End',
-            accessor: 'announcements.end',
-        },
-        {
-            Header: 'Announcement',
-            accessor: 'announcements.announcement',
-        }
-
-    ];
+    const columns = [];
 
     const testid = "AnnouncementsTable";
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: Announcement Id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: b

[Killed] ObjectLiteral
main/components/Announcements/AnnouncementsTable.js:39:9
 
 
     const columns = [
-        {
-            Header: 'Announcement Id',
-            accessor: 'announcements.id', 
-
-        },
+        {},
         {
             Header:'Commons Id',
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Announcements/AnnouncementsTable.js:44:9
             accessor: 'announcements.id', 
 
         },
-        {
-            Header:'Commons Id',
-            accessor: 'announcements.commonsId',
-        },
+        {},
         {
             Header: 'Start',
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Announcements/AnnouncementsTable.js:50:23
         },
         {
             Header: 'Start',
-            accessor: 'announcements.start',
+            accessor: "",
         },
         {
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="AnnouncementsTable-cell-row-0-col-announcements.start"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] ObjectLiteral
main/components/Announcements/AnnouncementsTable.js:52:9
             Header: 'Start',
             accessor: 'announcements.start',
         },
-        {
-            Header: 'End',
-            accessor: 'announcements.end',
-        },
+        {},
         {
             Header: 'Announcement',
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Announcements/AnnouncementsTable.js:58:23
         },
         {
             Header: 'Announcement',
-            accessor: 'announcements.announcement',
+            accessor: "",
         }
 
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="AnnouncementsTable-cell-row-0-col-announcements.announcement"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] StringLiteral
main/components/Announcements/AnnouncementsTable.js:63:20
 
     ];
 
-    const testid = "AnnouncementsTable";
+    const testid = "";
 
     const columnsIfAdmin = [
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="AnnouncementsTable-cell-row-0-col-announcements.id"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] ArrayDeclaration
main/components/Announcements/AnnouncementsTable.js:65:28
 
     const testid = "AnnouncementsTable";
 
-    const columnsIfAdmin = [
-        ...columns,
-        ButtonColumn("Edit", "primary", editCallback, testid),
-        ButtonColumn("Delete", "danger", deleteCallback, testid),
-    ];
+    const columnsIfAdmin = [];
 
     const columnsToDisplay = hasRole(currentUser,"ROLE_ADMIN") ? columnsIfAdmin : columns;
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: Announcement Id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: b

[Killed] ArrowFunction
main/components/Announcements/AnnouncementsTable.js:74:80
     const columnsToDisplay = hasRole(currentUser,"ROLE_ADMIN") ? columnsIfAdmin : columns;
 
     const announcementsModal = (
-        <Modal data-testid="AnnouncementsTable-Modal" show={showModal} onHide={() => setShowModal(false)}>
+        <Modal data-testid="AnnouncementsTable-Modal" show={showModal} onHide={() => undefined}>
             <Modal.Header closeButton>
                 <Modal.Title>Confirm Deletion</Modal.Title>
killedBy: Modal tests Pressing the escape key on the modal cancels the deletion
statusReason: Error: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

<html>

[Killed] BooleanLiteral
main/components/Announcements/AnnouncementsTable.js:74:99
     const columnsToDisplay = hasRole(currentUser,"ROLE_ADMIN") ? columnsIfAdmin : columns;
 
     const announcementsModal = (
-        <Modal data-testid="AnnouncementsTable-Modal" show={showModal} onHide={() => setShowModal(false)}>
+        <Modal data-testid="AnnouncementsTable-Modal" show={showModal} onHide={() => setShowModal(true)}>
             <Modal.Header closeButton>
                 <Modal.Title>Confirm Deletion</Modal.Title>
killedBy: Modal tests Pressing the escape key on the modal cancels the deletion
statusReason: Error: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

<html>

[Killed] ArrowFunction
main/components/Announcements/AnnouncementsTable.js:82:100
                 Are you sure you want to delete this announcements?            
             </Modal.Body>
             <Modal.Footer>
-                <Button variant="secondary" data-testid="AnnouncementsTable-Modal-Cancel" onClick={() => setShowModal(false)}>
+                <Button variant="secondary" data-testid="AnnouncementsTable-Modal-Cancel" onClick={() => undefined}>
                     Keep this Announcement
                 </Button>
killedBy: Modal tests Clicking Keep this Announcements button cancels the deletion
statusReason: Error: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

<html>

[Killed] BooleanLiteral
main/components/Announcements/AnnouncementsTable.js:82:119
                 Are you sure you want to delete this announcements?            
             </Modal.Body>
             <Modal.Footer>
-                <Button variant="secondary" data-testid="AnnouncementsTable-Modal-Cancel" onClick={() => setShowModal(false)}>
+                <Button variant="secondary" data-testid="AnnouncementsTable-Modal-Cancel" onClick={() => setShowModal(true)}>
                     Keep this Announcement
                 </Button>
killedBy: Modal tests Clicking Keep this Announcements button cancels the deletion
statusReason: Error: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

<html>

[Killed] ArrowFunction
main/components/Announcements/AnnouncementsTable.js:85:97
                 <Button variant="secondary" data-testid="AnnouncementsTable-Modal-Cancel" onClick={() => setShowModal(false)}>
                     Keep this Announcement
                 </Button>
-                <Button variant="danger" data-testid="AnnouncementsTable-Modal-Delete" onClick={() => confirmDelete(cellToDelete)}>
+                <Button variant="danger" data-testid="AnnouncementsTable-Modal-Delete" onClick={() => undefined}>
                     Permanently Delete
                 </Button>
killedBy: Modal tests Clicking Permanently Delete button deletes the announcements
statusReason: Error: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

<html>

[Killed] LogicalOperator
main/components/Announcements/AnnouncementsTable.js:98:10
             columns={columnsToDisplay}
             testid={testid}
         />
-        {hasRole(currentUser,"ROLE_ADMIN") && announcementsModal}
+        {hasRole(currentUser, "ROLE_ADMIN") || announcementsModal}
     </>);
 };
killedBy: Modal tests Clicking Delete button opens the modal for adminUser
statusReason: Error: expect(element).toHaveClass("modal-open")

Expected the element to have class:
  modal-open
Received:


<html>

[Killed] ConditionalExpression
main/components/Announcements/AnnouncementsTable.js:98:10
             columns={columnsToDisplay}
             testid={testid}
         />
-        {hasRole(currentUser,"ROLE_ADMIN") && announcementsModal}
+        {true}
     </>);
 };
killedBy: Modal tests Clicking Delete button opens the modal for adminUser
statusReason: Error: expect(element).toHaveClass("modal-open")

Expected the element to have class:
  modal-open
Received:


<html>
