[Killed] BlockStatement
src/main/utils/announcementsUtils.js:8:47
     toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/announcements",
-        method: "DELETE",
-        params: {
-            id: cell.row.values["announcements.id"]
-        }
-    }
-}
+export function cellToAxiosParamsDelete(cell) {}
 
 
killedBy: AnnouncementssUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"method": "DELETE", "params": {"id": 17}, "url": "/api/announcements"}
Received: undefined

[Killed] StringLiteral
src/main/utils/announcementsUtils.js:13:33
         url: "/api/announcements",
         method: "DELETE",
         params: {
-            id: cell.row.values["announcements.id"]
+            id: cell.row.values[""]
         }
     }
killedBy: AnnouncementssUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "method": "DELETE",
    "params": Object {
