[Killed] ConditionalExpression
src/main/components/OurTable.js:28:9
   } = useTable({
     columns,
     data,
-    ...(rest.initialState && {
-      initialState: rest.initialState
-    })
+    ...(true)
   }, useSortBy)
 
killedBy: PagedJobsTable tests renders correct content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  🔽
Received:

[Timeout] ArithmeticOperator
src/main/components/OurTable.js:33:31
     })
   }, useSortBy)
 
-  const pageCount = Math.ceil(data.length / pageSize);
+  const pageCount = Math.ceil(data.length * pageSize);
   const nextPage = () => {
     setCurrentPage(currentPage => Math.min(currentPage + 1, pageCount - 1));

[Timeout] BlockStatement
src/main/components/OurTable.js:34:26
   }, useSortBy)
 
   const pageCount = Math.ceil(data.length / pageSize);
-  const nextPage = () => {
-    setCurrentPage(currentPage => Math.min(currentPage + 1, pageCount - 1));
-  };
+  const nextPage = () => {};
   const prevPage = () => {
     setCurrentPage(currentPage => Math.max(currentPage - 1, 0));

[Timeout] ArithmeticOperator
src/main/components/OurTable.js:35:61
 
   const pageCount = Math.ceil(data.length / pageSize);
   const nextPage = () => {
-    setCurrentPage(currentPage => Math.min(currentPage + 1, pageCount - 1));
+    setCurrentPage(currentPage => Math.min(currentPage + 1, pageCount + 1));
   };
   const prevPage = () => {

[Timeout] ArithmeticOperator
src/main/components/OurTable.js:35:44
 
   const pageCount = Math.ceil(data.length / pageSize);
   const nextPage = () => {
-    setCurrentPage(currentPage => Math.min(currentPage + 1, pageCount - 1));
+    setCurrentPage(currentPage => Math.min(currentPage - 1, pageCount - 1));
   };
   const prevPage = () => {

[Timeout] BlockStatement
src/main/components/OurTable.js:37:26
   const nextPage = () => {
     setCurrentPage(currentPage => Math.min(currentPage + 1, pageCount - 1));
   };
-  const prevPage = () => {
-    setCurrentPage(currentPage => Math.max(currentPage - 1, 0));
-  };
+  const prevPage = () => {};
   const gotoPage = (pageIndex) => {
     setCurrentPage(Math.min(Math.max(pageIndex, 0), pageCount - 1));

[Timeout] ArithmeticOperator
src/main/components/OurTable.js:38:44
     setCurrentPage(currentPage => Math.min(currentPage + 1, pageCount - 1));
   };
   const prevPage = () => {
-    setCurrentPage(currentPage => Math.max(currentPage - 1, 0));
+    setCurrentPage(currentPage => Math.max(currentPage + 1, 0));
   };
   const gotoPage = (pageIndex) => {

[Timeout] ArrowFunction
src/main/components/OurTable.js:38:20
     setCurrentPage(currentPage => Math.min(currentPage + 1, pageCount - 1));
   };
   const prevPage = () => {
-    setCurrentPage(currentPage => Math.max(currentPage - 1, 0));
+    setCurrentPage(() => undefined);
   };
   const gotoPage = (pageIndex) => {

[Timeout] BlockStatement
src/main/components/OurTable.js:40:35
   const prevPage = () => {
     setCurrentPage(currentPage => Math.max(currentPage - 1, 0));
   };
-  const gotoPage = (pageIndex) => {
-    setCurrentPage(Math.min(Math.max(pageIndex, 0), pageCount - 1));
-  };
+  const gotoPage = (pageIndex) => {};
 
     return (

[Survived] ArithmeticOperator
src/main/components/OurTable.js:41:53
     setCurrentPage(currentPage => Math.max(currentPage - 1, 0));
   };
   const gotoPage = (pageIndex) => {
-    setCurrentPage(Math.min(Math.max(pageIndex, 0), pageCount - 1));
+    setCurrentPage(Math.min(Math.max(pageIndex, 0), pageCount + 1));
   };
 

[Survived] MethodExpression
src/main/components/OurTable.js:69:12
           ))}
         </thead>
         <tbody {...getTableBodyProps()}>
-          {rows
-            .slice(currentPage * pageSize, (currentPage + 1) * pageSize)
+          {rows
             .map(row => {
             prepareRow(row)

[Survived] ArithmeticOperator
src/main/components/OurTable.js:70:20
         </thead>
         <tbody {...getTableBodyProps()}>
           {rows
-            .slice(currentPage * pageSize, (currentPage + 1) * pageSize)
+            .slice(currentPage / pageSize, (currentPage + 1) * pageSize)
             .map(row => {
             prepareRow(row)

[Timeout] ArithmeticOperator
src/main/components/OurTable.js:70:45
         </thead>
         <tbody {...getTableBodyProps()}>
           {rows
-            .slice(currentPage * pageSize, (currentPage + 1) * pageSize)
+            .slice(currentPage * pageSize, (currentPage - 1) * pageSize)
             .map(row => {
             prepareRow(row)

[Timeout] BlockStatement
src/main/components/OurTable.js:71:25
         <tbody {...getTableBodyProps()}>
           {rows
             .slice(currentPage * pageSize, (currentPage + 1) * pageSize)
-            .map(row => {
-            prepareRow(row)
-            return (
-              <tr {...row.getRowProps()}>
-                {row.cells.map((cell, _index) => {
-                  return (
-                    <td
-                      {...cell.getCellProps()}
-                      data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}`}
-                    >
-                      {cell.render('Cell')}
-                    </td>
-                  )
-                })}
-              </tr>
-            )
-          })}
+            .map(row => {})}
         </tbody>
       </Table>

[Timeout] EqualityOperator
src/main/components/OurTable.js:91:54
         </tbody>
       </Table>
       <div>
-        <button onClick={() => prevPage()} disabled={currentPage === 0}>Previous</button>
+        <button onClick={() => prevPage()} disabled={currentPage !== 0}>Previous</button>
         <button onClick={() => nextPage()} disabled={currentPage >= pageCount - 1}>Next</button>
         <span>

[Timeout] ConditionalExpression
src/main/components/OurTable.js:91:54
         </tbody>
       </Table>
       <div>
-        <button onClick={() => prevPage()} disabled={currentPage === 0}>Previous</button>
+        <button onClick={() => prevPage()} disabled={true}>Previous</button>
         <button onClick={() => nextPage()} disabled={currentPage >= pageCount - 1}>Next</button>
         <span>

[Timeout] ArrowFunction
src/main/components/OurTable.js:92:26
       </Table>
       <div>
         <button onClick={() => prevPage()} disabled={currentPage === 0}>Previous</button>
-        <button onClick={() => nextPage()} disabled={currentPage >= pageCount - 1}>Next</button>
+        <button onClick={() => undefined} disabled={currentPage >= pageCount - 1}>Next</button>
         <span>
           Page{' '}

[Timeout] ConditionalExpression
src/main/components/OurTable.js:92:54
       </Table>
       <div>
         <button onClick={() => prevPage()} disabled={currentPage === 0}>Previous</button>
-        <button onClick={() => nextPage()} disabled={currentPage >= pageCount - 1}>Next</button>
+        <button onClick={() => nextPage()} disabled={true}>Next</button>
         <span>
           Page{' '}

[Timeout] ArithmeticOperator
src/main/components/OurTable.js:96:14
         <span>
           Page{' '}
           <strong>
-            {currentPage + 1} of {pageCount}
+            {currentPage - 1} of {pageCount}
           </strong>{' '}
         </span>

[Timeout] StringLiteral
src/main/components/OurTable.js:100:25
           </strong>{' '}
         </span>
         <span>
-          | Go to page:{' '}
+          | Go to page:{""}
           <input
             type="number"

[Timeout] ArithmeticOperator
src/main/components/OurTable.js:103:27
           | Go to page:{' '}
           <input
             type="number"
-            defaultValue={currentPage + 1}
+            defaultValue={currentPage - 1}
             onChange={e => {
               const pageIndex = e.target.value ? Number(e.target.value) - 1 : 0;

[Timeout] BlockStatement
src/main/components/OurTable.js:104:28
           <input
             type="number"
             defaultValue={currentPage + 1}
-            onChange={e => {
-              const pageIndex = e.target.value ? Number(e.target.value) - 1 : 0;
-              gotoPage(pageIndex);
-            }}
+            onChange={e => {}}
             style={{ width: '50px' }}
           />

[Timeout] ArithmeticOperator
src/main/components/OurTable.js:105:50
             type="number"
             defaultValue={currentPage + 1}
             onChange={e => {
-              const pageIndex = e.target.value ? Number(e.target.value) - 1 : 0;
+              const pageIndex = e.target.value ? Number(e.target.value) + 1 : 0;
               gotoPage(pageIndex);
             }}

[Survived] ObjectLiteral
src/main/components/OurTable.js:108:20
               const pageIndex = e.target.value ? Number(e.target.value) - 1 : 0;
               gotoPage(pageIndex);
             }}
-            style={{ width: '50px' }}
+            style={{}}
           />
         </span>

[Survived] StringLiteral
src/main/components/OurTable.js:108:29
               const pageIndex = e.target.value ? Number(e.target.value) - 1 : 0;
               gotoPage(pageIndex);
             }}
-            style={{ width: '50px' }}
+            style={{ width: "" }}
           />
         </span>

[Timeout] StringLiteral
src/main/components/OurTable.js:166:22
       <Button
         variant={variant}
         href={`${href}${cell.row.values["commons.id"]}`}
-        data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
+        data-testid={``}
       >
         {label}

[Killed] StringLiteral
src/main/components/OurTable.js:188:45
 
 export function DateColumn(label, getDate) {
   const options = {
-    year: 'numeric', month: 'numeric', day: 'numeric',
+    year: 'numeric', month: 'numeric', day: "",
     hour: 'numeric', minute: 'numeric', second: 'numeric',
     hour12: false,
killedBy: AdminJobsPage tests renders without crashing
statusReason: RangeError: Value  out of range for Intl.DateTimeFormat options property day

[Killed] StringLiteral
src/main/components/OurTable.js:189:30
 export function DateColumn(label, getDate) {
   const options = {
     year: 'numeric', month: 'numeric', day: 'numeric',
-    hour: 'numeric', minute: 'numeric', second: 'numeric',
+    hour: 'numeric', minute: "", second: 'numeric',
     hour12: false,
     timeZone: 'America/Los_Angeles'
killedBy: AdminJobsPage tests renders without crashing
statusReason: RangeError: Value  out of range for Intl.DateTimeFormat options property minute
