[Killed] BlockStatement
main/components/Announcements/AnnouncementsTable.js:12:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/admin/announcements/edit/${cell.row.values.id}`);
-    }
+    const editCallback = (cell) => {}
 
     const deleteMutation = useBackendMutation(
killedBy: HelpRequestTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/admin/announcements/edit/1"

Number of calls: 0

<html>
  <head />

[Killed] ObjectLiteral
main/components/Announcements/AnnouncementsTable.js:27:9
 
 
     const columns = [
-        {
-            Header: 'Id',
-            accessor: 'id', 
-
-        },
+        {},
         {
             Header:'CommonsId',
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Announcements/AnnouncementsTable.js:33:20
 
         },
         {
-            Header:'CommonsId',
+            Header:"",
             accessor: 'commonsId',
         },
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: CommonsId. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block;
