[Killed] StringLiteral
main/components/Announcements/AnnouncementsTable.js:8:89
 import { useNavigate, } from "react-router-dom";
 import { hasRole } from "main/utils/currentUser";
 
-export default function AnnouncementsTable({ announcements, currentUser, testIdPrefix = "AnnouncementsTable"}) {
+export default function AnnouncementsTable({ announcements, currentUser, testIdPrefix = ""}) {
 
     const navigate = useNavigate();
killedBy: HelpRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="AnnouncementsTable-cell-row-0-col-id"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] BlockStatement
main/components/Announcements/AnnouncementsTable.js:12:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/admin/announcements/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: HelpRequestTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/admin/announcements/edit/1"

Number of calls: 0

<html>
  <head />

[Killed] ArrayDeclaration
main/components/Announcements/AnnouncementsTable.js:28:21
     const deleteCallback = async (cell) => { deleteMutation.mutate(cell); }
 
 
-    const columns = [
-        {
-            Header: 'Id',
-            accessor: 'id', 
-
-        },
-        {
-            Header: 'Start',
-            accessor: 'start',
-        },
-        {
-            Header: 'End',
-            accessor: 'end',
-        },
-        {
-            Header: 'Announcement',
-            accessor: 'announcement',
-        }
-
-    ];
+    const columns = [];
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-wid

[Killed] StringLiteral
main/components/Announcements/AnnouncementsTable.js:31:23
     const columns = [
         {
             Header: 'Id',
-            accessor: 'id', 
+            accessor: "", 
 
         },
killedBy: HelpRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="AnnouncementsTable-cell-row-0-col-id"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] StringLiteral
main/components/Announcements/AnnouncementsTable.js:39:21
             accessor: 'start',
         },
         {
-            Header: 'End',
+            Header: "",
             accessor: 'end',
         },
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: End. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-wi

[Killed] StringLiteral
main/components/Announcements/AnnouncementsTable.js:40:23
         },
         {
             Header: 'End',
-            accessor: 'end',
+            accessor: "",
         },
         {
killedBy: HelpRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="AnnouncementsTable-cell-row-0-col-end"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"
