[Killed] StringLiteral
main/components/Announcements/AnnouncementsForm.js:6:74
 import { useNavigate } from 'react-router-dom';
 
 
-function AnnouncementsForm({initialContents, submitAction, buttonLabel = "Create"}) {
+function AnnouncementsForm({initialContents, submitAction, buttonLabel = ""}) {
 
     const {
killedBy: AnnouncementsForm tests renders correctly with no initialContents
statusReason: Error: Unable to find an element with the text: /Create/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Announcements/AnnouncementsForm.js:14:25
         handleSubmit,
     } = useForm(
         // modifiedCommons is guaranteed to be defined (initialCommons or {})
-        {defaultValues: initialContents || {}, }
+        {defaultValues: true, }
     );
 
killedBy: AnnouncementsForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot create property 'start' on boolean 'true'

[Killed] ConditionalExpression
main/components/Announcements/AnnouncementsForm.js:14:25
         handleSubmit,
     } = useForm(
         // modifiedCommons is guaranteed to be defined (initialCommons or {})
-        {defaultValues: initialContents || {}, }
+        {defaultValues: false, }
     );
 
killedBy: AnnouncementsForm tests renders correctly when passing in initialContents
statusReason: Error: expect(element).toHaveValue(2012-03-05T15:50)

Expected the element to have value:
  2012-03-05T15:50
Received:

[Killed] ObjectLiteral
main/components/Announcements/AnnouncementsForm.js:56:43
                     id="start"
                     type="datetime-local" 
                     isInvalid={Boolean(errors.start)}
-                    {...register("start", {
-                        required: "Start is required.",
-                    })}
+                    {...register("start", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: AnnouncementsForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Start is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Announcements/AnnouncementsForm.js:72:34
                     id="end"
                     type="datetime-local" 
                     isInvalid={Boolean(errors.end)}
-                    {...register("end")}
+                    {...register("")}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: AnnouncementsForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/Announcements/AnnouncementsForm.js:84:49
                 <Form.Control
                     //as="textarea" 
                     //rows={4}
-                    data-testid={testIdPrefix + "announcement"}
+                    data-testid={testIdPrefix + ""}
                     id="announcement"
                     type="text"
killedBy: AnnouncementsForm tests No Error messsages on good input
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="AnnouncementsForm-announcement"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Announcements/AnnouncementsForm.js:88:50
                     id="announcement"
                     type="text"
                     isInvalid={Boolean(errors.announcement)}
-                    {...register("announcement", {
-                        required: "Announcement is required.",
-                    })}
+                    {...register("announcement", {})}
                 >
                 </Form.Control>
killedBy: AnnouncementsForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Announcement is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Announcements/AnnouncementsForm.js:88:34
                     id="announcement"
                     type="text"
                     isInvalid={Boolean(errors.announcement)}
-                    {...register("announcement", {
+                    {...register("", {
                         required: "Announcement is required.",
                     })}
killedBy: AnnouncementsForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] OptionalChaining
main/components/Announcements/AnnouncementsForm.js:94:22
                 >
                 </Form.Control>
                 <Form.Control.Feedback type="invalid">
-                    {errors.announcement?.message}
+                    {errors.announcement.message}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: AnnouncementsForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')
