[Killed] BlockStatement
src/main/utils/announcementsUtils.js:3:47
 import { toast } from "react-toastify";
 
-export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/announcements",
-        method: "DELETE",
-        params: {
-            id: cell.row.values.id
-        }
-    }
-}
+export function cellToAxiosParamsDelete(cell) {}
 
 export function onDeleteSuccess(message) {
killedBy: AnnouncementsUtils It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"method": "DELETE", "params": {"id": 17}, "url": "/api/announcements"}
Received: undefined

[Killed] ObjectLiteral
src/main/utils/announcementsUtils.js:4:12
 import { toast } from "react-toastify";
 
 export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/announcements",
-        method: "DELETE",
-        params: {
-            id: cell.row.values.id
-        }
-    }
+    return {}
 }
 
killedBy: AnnouncementsUtils It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Object {
-   "method": "DELETE",
-   "params": Object {

[Killed] StringLiteral
src/main/utils/announcementsUtils.js:5:14
 
 export function cellToAxiosParamsDelete(cell) {
     return {
-        url: "/api/announcements",
+        url: "",
         method: "DELETE",
         params: {
killedBy: AnnouncementsUtils It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "method": "DELETE",
    "params": Object {
