[Killed] ArithmeticOperator
src/main/components/OurTable.js:92:69
       </Table>
       <div>
         <button onClick={() => prevPage()} disabled={currentPage === 0}>Previous</button>
-        <button onClick={() => nextPage()} disabled={currentPage >= pageCount - 1}>Next</button>
+        <button onClick={() => nextPage()} disabled={currentPage >= pageCount + 1}>Next</button>
         <span>
           Page{""}
killedBy: OurTable tests click on next and change pages
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:
  <button />

[Killed] EqualityOperator
src/main/components/OurTable.js:92:54
       </Table>
       <div>
         <button onClick={() => prevPage()} disabled={currentPage === 0}>Previous</button>
-        <button onClick={() => nextPage()} disabled={currentPage >= pageCount - 1}>Next</button>
+        <button onClick={() => nextPage()} disabled={currentPage < pageCount - 1}>Next</button>
         <span>
           Page{""}
killedBy: OurTable tests click on next and change pages
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="sampleTestId-cell-row-10-col-col1"]

<body>
  <div>
    <div>
      <table
        class="table table-striped table-bordered table-hover"
        role="table"
