[Timeout] BlockStatement
src/main/components/OurTable.js:34:26
   }, useSortBy)
 
   const pageCount = Math.ceil(data.length / pageSize);
-  const nextPage = () => {
-    setCurrentPage(currentPage => (currentPage + 1));
-  };
+  const nextPage = () => {};
   const prevPage = () => {
     setCurrentPage(currentPage => (currentPage - 1));

[Timeout] ArithmeticOperator
src/main/components/OurTable.js:35:36
 
   const pageCount = Math.ceil(data.length / pageSize);
   const nextPage = () => {
-    setCurrentPage(currentPage => (currentPage + 1));
+    setCurrentPage(currentPage => (currentPage - 1));
   };
   const prevPage = () => {

[Timeout] ArrowFunction
src/main/components/OurTable.js:35:20
 
   const pageCount = Math.ceil(data.length / pageSize);
   const nextPage = () => {
-    setCurrentPage(currentPage => (currentPage + 1));
+    setCurrentPage(() => undefined);
   };
   const prevPage = () => {

[Timeout] BlockStatement
src/main/components/OurTable.js:37:26
   const nextPage = () => {
     setCurrentPage(currentPage => (currentPage + 1));
   };
-  const prevPage = () => {
-    setCurrentPage(currentPage => (currentPage - 1));
-  };
+  const prevPage = () => {};
   const gotoPage = (pageIndex) => {
     setCurrentPage(Math.min(Math.max(pageIndex, 0), pageCount - 1));

[Timeout] ArithmeticOperator
src/main/components/OurTable.js:38:36
     setCurrentPage(currentPage => (currentPage + 1));
   };
   const prevPage = () => {
-    setCurrentPage(currentPage => (currentPage - 1));
+    setCurrentPage(currentPage => (currentPage + 1));
   };
   const gotoPage = (pageIndex) => {

[Timeout] ArrowFunction
src/main/components/OurTable.js:38:20
     setCurrentPage(currentPage => (currentPage + 1));
   };
   const prevPage = () => {
-    setCurrentPage(currentPage => (currentPage - 1));
+    setCurrentPage(() => undefined);
   };
   const gotoPage = (pageIndex) => {
